RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drivers/drv_usart_v2.c
        if (ctrl_arg == RT_DEVICE_FLAG_INT_RX)
            __HAL_UART_ENABLE_IT(&(uart->handle), UART_IT_RXNE);
        else if (ctrl_arg == RT_DEVICE_FLAG_INT_TX)
            __HAL_UART_ENABLE_IT(&(uart->handle), UART_IT_TXE);
        break;

    case RT_DEVICE_CTRL_CONFIG:
        if (ctrl_arg & (RT_DEVICE_FLAG_DMA_RX | RT_DEVICE_FLAG_DMA_TX))
        {
#ifdef RT_SERIAL_USING_DMA
            return stm32_uart_dma_config(serial, ctrl_arg);
#else
            return -RT_ENOSYS;
#endif
        }
        else
        {
            return stm32_control(serial, RT_DEVICE_CTRL_SET_INT, (void *)ctrl_arg);
        }
        break;

    case RT_DEVICE_CHECK_OPTMODE:
    {
        if (ctrl_arg & RT_DEVICE_FLAG_DMA_TX)
            return RT_SERIAL_TX_BLOCKING_NO_BUFFER;
        else
            return RT_SERIAL_TX_BLOCKING_BUFFER;
    }
    case RT_DEVICE_CTRL_CLOSE:
    {
        uart->error_indicate = RT_NULL;
        HAL_StatusTypeDef status = HAL_UART_DeInit(&uart->handle);
        if (status != HAL_OK)
        {
            LOG_E("(%s) serial deinit error %d!", serial->parent.parent.name, status);
        }
        break;
    }
    case UART_CTRL_SET_ERROR_CALLBACK:
    {
        uart->error_indicate = (rt_err_t (*)(rt_device_t dev, rt_uint32_t error_code))arg;
        break;
    }
    }

    return RT_EOK;
}

static int stm32_putc(struct rt_serial_device *serial, char c)
{
    struct stm32_uart *uart;
    RT_ASSERT(serial != RT_NULL);

    uart = rt_container_of(serial, struct stm32_uart, serial);
    UART_INSTANCE_CLEAR_FUNCTION(&(uart->handle), UART_FLAG_TC);
    UART_SET_TDR(&uart->handle, c);
    while (__HAL_UART_GET_FLAG(&(uart->handle), UART_FLAG_TC) == RESET);

    return 1;
}

rt_uint32_t stm32_uart_get_mask(rt_uint32_t word_length, rt_uint32_t parity)
{
    rt_uint32_t mask = 0;
    if (word_length == UART_WORDLENGTH_8B)
    {
        if (parity == UART_PARITY_NONE)
        {
            mask = 0x00FFU;
        }
        else
        {
            mask = 0x007FU;
        }
    }
#ifdef UART_WORDLENGTH_9B
    else if (word_length == UART_WORDLENGTH_9B)
    {
        if (parity == UART_PARITY_NONE)
        {
            mask = 0x01FFU;
        }
        else
        {
            mask = 0x00FFU;
        }
    }
#endif
#ifdef UART_WORDLENGTH_7B
    else if (word_length == UART_WORDLENGTH_7B)
    {
        if (parity == UART_PARITY_NONE)
        {
            mask = 0x007FU;
        }
        else
        {
            mask = 0x003FU;
        }
    }
    else
    {
        mask = 0x0000U;
    }
#endif
    return mask;
}

static int stm32_getc(struct rt_serial_device *serial)
{
    int                ch;
    struct stm32_uart *uart;
    RT_ASSERT(serial != RT_NULL);
    uart = rt_container_of(serial, struct stm32_uart, serial);

    ch = -1;
    if (__HAL_UART_GET_FLAG(&(uart->handle), UART_FLAG_RXNE) != RESET)
        ch = UART_GET_RDR(&uart->handle, stm32_uart_get_mask(uart->handle.Init.WordLength, uart->handle.Init.Parity));
    return ch;
}

static rt_ssize_t stm32_transmit(struct rt_serial_device *serial,
                                 rt_uint8_t              *buf,
                                 rt_size_t                size,
                                 rt_uint32_t              tx_flag)
{
    struct stm32_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    RT_ASSERT(buf != RT_NULL);
    uart = rt_container_of(serial, struct stm32_uart, serial);

    if (uart->uart_dma_flag & RT_DEVICE_FLAG_DMA_TX)
    {
        if (HAL_UART_Transmit_DMA(&uart->handle, buf, size) != HAL_OK)
        {
            return -RT_EIO;
        }

        return size;
    }

    /* NOLINTNEXTLINE(performance-no-int-to-ptr) */
    if (stm32_control(serial, RT_DEVICE_CTRL_SET_INT, (void *)tx_flag) != RT_EOK)
    {
        return -RT_EIO;
    }

    return size;
}

#ifdef RT_SERIAL_USING_DMA
/**
 * @brief Resolve effective STM32 UART RX DMA event mode.
 * @param request Requested RX DMA event mode.
 * @param effective Pointer to the output effective mode.
 * @return Operation status.
 */
static rt_err_t stm32_uart_resolve_rx_dma_event_mode(enum rt_serial_rx_dma_event_mode request,
                                                     enum rt_serial_rx_dma_event_mode *effective)
{
    if (effective == RT_NULL)
    {
        return -RT_EINVAL;
    }

    if (request == RT_SERIAL_RX_DMA_EVENT_AUTO)
    {
        *effective = RT_SERIAL_RX_DMA_EVENT_HALF_FULL;
        return RT_EOK;
    }

    if ((request != RT_SERIAL_RX_DMA_EVENT_NONE) &&
        (request != RT_SERIAL_RX_DMA_EVENT_FULL_ONLY) &&
        (request != RT_SERIAL_RX_DMA_EVENT_HALF_FULL))
    {
        return -RT_EINVAL;
    }

    *effective = request;
    return RT_EOK;
}

/**
 * @brief Configure STM32 UART RX DMA transfer event interrupts.
 * @param dma_handle Pointer to the RX DMA handle linked to the UART.
 * @param mode Effective serial RX DMA event mode.
 */
static void stm32_uart_configure_rx_dma_events(DMA_HandleTypeDef *dma_handle, enum rt_serial_rx_dma_event_mode mode)
{
    if (dma_handle == RT_NULL)
    {
        return;
    }

    if (mode == RT_SERIAL_RX_DMA_EVENT_NONE)
    {
        __HAL_DMA_DISABLE_IT(dma_handle, DMA_IT_HT);
        __HAL_DMA_DISABLE_IT(dma_handle, DMA_IT_TC);
    }
    else if (mode == RT_SERIAL_RX_DMA_EVENT_FULL_ONLY)
    {
        __HAL_DMA_DISABLE_IT(dma_handle, DMA_IT_HT);
        __HAL_DMA_ENABLE_IT(dma_handle, DMA_IT_TC);
    }
    else
    {
        __HAL_DMA_ENABLE_IT(dma_handle, DMA_IT_HT);
        __HAL_DMA_ENABLE_IT(dma_handle, DMA_IT_TC);
    }
}

/**
 * @brief Check whether one STM32 UART RX DMA event should be handled.
 * @param serial Pointer to the serial device.
 * @param isr_flag UART RX DMA ISR source flag.
 * @return RT_TRUE if the event should be handled.
 */
static rt_bool_t stm32_uart_rx_dma_event_enabled(struct rt_serial_device *serial, rt_uint8_t isr_flag)
{
    enum rt_serial_rx_dma_event_mode mode;

    RT_ASSERT(serial != RT_NULL);

    if (isr_flag == UART_RX_DMA_IT_IDLE_FLAG)
    {
        return RT_TRUE;
    }

    if (stm32_uart_resolve_rx_dma_event_mode(serial->config.rx_dma_event_mode, &mode) != RT_EOK)
    {
        return RT_FALSE;
    }

    if (isr_flag == UART_RX_DMA_IT_HT_FLAG)
    {
        return (mode == RT_SERIAL_RX_DMA_EVENT_HALF_FULL) ? RT_TRUE : RT_FALSE;
    }

    if (isr_flag == UART_RX_DMA_IT_TC_FLAG)
    {
        return (mode != RT_SERIAL_RX_DMA_EVENT_NONE) ? RT_TRUE : RT_FALSE;
    }

    return RT_FALSE;
}

