RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drivers/drv_usart_v2.c
#ifdef BSP_LPUART1_RX_USING_DMA
    uart_obj[LPUART1_INDEX].serial.config.dma_ping_bufsz    = BSP_LPUART1_DMA_PING_BUFSIZE;
    uart_obj[LPUART1_INDEX].uart_dma_flag                   |= RT_DEVICE_FLAG_DMA_RX;
    static const struct stm32_dma_config lpuart1_dma_rx     = LPUART1_DMA_CONFIG;
    uart_config[LPUART1_INDEX].dma_rx                       = &lpuart1_dma_rx;
#endif
#endif
}

#ifdef RT_SERIAL_USING_DMA
static rt_err_t stm32_uart_dma_config(struct rt_serial_device *serial, rt_ubase_t flag)
{
    DMA_HandleTypeDef *DMA_Handle;
    const struct stm32_dma_config *dma_config;
    struct stm32_uart *uart;
    enum rt_serial_rx_dma_event_mode event_mode;

    RT_ASSERT(serial != RT_NULL);
    RT_ASSERT(flag == RT_DEVICE_FLAG_DMA_TX || flag == RT_DEVICE_FLAG_DMA_RX);
    uart = rt_container_of(serial, struct stm32_uart, serial);

    if (RT_DEVICE_FLAG_DMA_RX == flag)
    {
        DMA_Handle = &uart->dma_rx.handle;
        dma_config = uart->config->dma_rx;
        if (stm32_uart_resolve_rx_dma_event_mode(serial->config.rx_dma_event_mode, &event_mode) != RT_EOK)
        {
            LOG_E("%s invalid uart dma rx event mode", uart->config->name);
            return -RT_EINVAL;
        }
    }
    else /* RT_DEVICE_FLAG_DMA_TX == flag */
    {
        DMA_Handle = &uart->dma_tx.handle;
        dma_config = uart->config->dma_tx;
    }
    LOG_D("%s dma config start", uart->config->name);

    if (RT_DEVICE_FLAG_DMA_RX == flag)
    {
        if (stm32_dma_setup(DMA_Handle,
                            &(uart->handle),
                            &uart->handle.hdmarx,
                            dma_config) != RT_EOK)
        {
            LOG_E("%s dma rx config failed", uart->config->name);
            return -RT_ERROR;
        }
    }
    else if (RT_DEVICE_FLAG_DMA_TX == flag)
    {
        if (stm32_dma_setup(DMA_Handle,
                            &(uart->handle),
                            &uart->handle.hdmatx,
                            dma_config) != RT_EOK)
        {
            LOG_E("%s dma tx config failed", uart->config->name);
            return -RT_ERROR;
        }
    }

    /* enable interrupt */
    if (flag == RT_DEVICE_FLAG_DMA_RX)
    {
        rt_uint8_t *ptr = NULL;
        rt_hw_serial_control_isr(serial, RT_HW_SERIAL_CTRL_GET_DMA_PING_BUF, (void *)&ptr);

        /* Start DMA transfer */
        if (HAL_UART_Receive_DMA(&(uart->handle), ptr, serial->config.dma_ping_bufsz) != HAL_OK)
        {
            /* Transfer error in reception process */
            LOG_E("%s uart dma rx start failed", uart->config->name);
            if (stm32_dma_deinit(DMA_Handle, dma_config, RT_FALSE) != RT_EOK)
            {
                LOG_E("%s uart dma rx rollback failed", uart->config->name);
            }
            uart->handle.hdmarx = RT_NULL;
            DMA_Handle->Parent = RT_NULL;
            return -RT_ERROR;
        }
        stm32_uart_configure_rx_dma_events(DMA_Handle, event_mode);
        CLEAR_BIT(uart->handle.Instance->CR3, USART_CR3_EIE);
        __HAL_UART_ENABLE_IT(&(uart->handle), UART_IT_IDLE);
    }

    HAL_NVIC_SetPriority(uart->config->irq_type, 1, 0);
    HAL_NVIC_EnableIRQ(uart->config->irq_type);

    LOG_D("%s dma %s instance: %x", uart->config->name, flag == RT_DEVICE_FLAG_DMA_RX ? "RX" : "TX", DMA_Handle->Instance);
    LOG_D("%s dma config done", uart->config->name);

    return RT_EOK;
}

/**
  * @brief  UART error callbacks
  * @param  huart: UART handle
  * @note   This example shows a simple way to report transfer error, and you can
  *         add your own implementation.
  * @retval None
  */
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
    RT_ASSERT(huart != NULL);
    struct stm32_uart *uart = (struct stm32_uart *)huart;
    LOG_D("%s: %s %d\n", __FUNCTION__, uart->config->name, huart->ErrorCode);
    UNUSED(uart);
    if(uart->error_indicate != RT_NULL)
    {
        uart->error_indicate(&uart->serial.parent, huart->ErrorCode);
    }
}

/**
  * @brief  Rx Transfer completed callback
  * @param  huart: UART handle
  * @note   This example shows a simple way to report end of DMA Rx transfer, and
  *         you can add your own implementation.
  * @retval None
  */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    struct stm32_uart *uart;
    RT_ASSERT(huart != NULL);
    uart = (struct stm32_uart *)huart;
    dma_recv_isr(&uart->serial, UART_RX_DMA_IT_TC_FLAG);
}

/**
  * @brief  Rx Half transfer completed callback
  * @param  huart: UART handle
  * @note   This example shows a simple way to report end of DMA Rx Half transfer,
  *         and you can add your own implementation.
  * @retval None
  */
void HAL_UART_RxHalfCpltCallback(UART_HandleTypeDef *huart)
{
    struct stm32_uart *uart;
    RT_ASSERT(huart != NULL);
    uart = (struct stm32_uart *)huart;
    dma_recv_isr(&uart->serial, UART_RX_DMA_IT_HT_FLAG);
}

/**
  * @brief  HAL_UART_TxCpltCallback
  * @param  huart: UART handle
  * @note   This callback can be called by two functions, first in UART_EndTransmit_IT when
  *         UART Tx complete and second in UART_DMATransmitCplt function in DMA Circular mode.
  * @retval None
  */
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
    struct stm32_uart       *uart;
    struct rt_serial_device *serial;
    rt_size_t                trans_total_index;
    rt_base_t                level;

    RT_ASSERT(huart != NULL);
    uart   = (struct stm32_uart *)huart;
    serial = &uart->serial;
    RT_ASSERT(serial != RT_NULL);

    level             = rt_hw_interrupt_disable();
    trans_total_index = __HAL_DMA_GET_COUNTER(&(uart->dma_tx.handle));
    rt_hw_interrupt_enable(level);

    if (trans_total_index) return;

    rt_hw_serial_isr(serial, RT_SERIAL_EVENT_TX_DMADONE);
}
#endif /* RT_SERIAL_USING_DMA */

static const struct rt_uart_ops stm32_uart_ops =
{
    .configure = stm32_configure,
    .control   = stm32_control,
    .putc      = stm32_putc,
    .getc      = stm32_getc,
    .transmit  = stm32_transmit
};

int rt_hw_usart_init(void)
{
    rt_err_t  result  = 0;
    rt_size_t obj_num = sizeof(uart_obj) / sizeof(struct stm32_uart);

    stm32_uart_get_config();
    for (rt_uint32_t i = 0; i < obj_num; i++)
    {
        /* init UART object */
        uart_obj[i].config     = &uart_config[i];
        uart_obj[i].serial.ops = &stm32_uart_ops;
        /* register UART device */
        result = rt_hw_serial_register(&uart_obj[i].serial,
                                       uart_obj[i].config->name,
                                       RT_DEVICE_FLAG_RDWR,
                                       NULL);
        RT_ASSERT(result == RT_EOK);
    }

    return result;
}

#endif /* RT_USING_SERIAL_V2 */
